# -*- coding: utf-8 -*-
"""
Created on Mon Sep 10 13:47:47 2018
回文数:
判断一个整数是否是回文数。回文数是指正序（从左向右）和倒序（从右向左）读都是一样的整数。
----------------------------------------------------------------------------------
示例 1:
输入: 121
输出: true

示例 2:
输入: -121
输出: false
解释: 从左向右读, 为 -121 。 从右向左读, 为 121- 。因此它不是一个回文数。

示例 3:
输入: 10
输出: false
解释: 从右向左读, 为 01 。因此它不是一个回文数。
@author: Wan G.S
"""
class Solution:
    def isPalindrome(self, x):
        """
        :type x: int
        :rtype: bool
        """
        if x < 0:
            return False
        elif x < 10:
            return True
        else:
            num = []
            while x > 0:
                num.append(x % 10)
                x //= 10
            return num == list(reversed(num))

# =============================================================================
# def isPalindrome(x):
#     return str(x) == str(x)[::-1]
# =============================================================================

